
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 36 to change, 6 to destroy.</code></pre>

* Update
  * azurerm_automation_account.automation_account
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;auto-pip-stg-courtel-api&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;b2c-test-account&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;b2c-test-account-pwd&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;courtel-certificate&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;gov-uk-notify-api-key&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;pip-team-email&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;apim-subscription-key&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-HOST&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PASSWORD&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PORT&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-nodejs-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-ad-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-admin-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-auth-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-admin-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-extension-app-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-token-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;cft-idam-client-secret&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;session-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-name&#34;]
  * module.kv.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds
  * module.redis.azurerm_redis_cache.redis
* Replace
  * azurerm_key_vault_access_policy.app_mi_access_policy
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.html&#34;]
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.apim_mi will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "apim_mi"  {
      ~ client_id           = "b6248509-d791-4c33-a5ff-d65afd40809f" -> (known after apply)
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "pip-apim-stg-mi"
      ~ principal_id        = "89b6f7ac-e4d5-477c-970e-65d9e725b398" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          - "application"         = "publishing-information-service"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "app_mi"  {
      ~ client_id           = "8d0ead51-3b31-44df-a78e-ada4eea9fe87" -> (known after apply)
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "pip-stg-mi"
      ~ principal_id        = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          - "application"         = "publishing-information-service"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
        name                          = "pip-ss-stg-aa"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (10 unchanged attributes hidden)


      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.app_mi_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "admin-mfa.html"
      ~ source_content         = <<-EOT # forces replacement
            <html lang="en" class="govuk-template ">
            <head>
              <meta charset="utf-8">
              <title>
                Login
              </title>
              <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
              <meta name="theme-color" content="#0b0c0c">
              <link rel="shortcut icon" sizes="16x16 32x32 48x48" href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico"
                    type="image/x-icon">
              <meta http-equiv="X-UA-Compatible" content="IE=edge">
              <link rel="stylesheet" href="login.css">
              <link rel="stylesheet" href="admin-mfa.css">
            </head>
            <body>
            <script>document.body.className = ((document.body.className) ? document.body.className + ' js-enabled' : 'js-enabled');</script>
            
            <a href="#main-content" class="govuk-skip-link">Skip to main content</a>
            
            <header class="govuk-header " role="banner" data-module="govuk-header">
              <div class="govuk-header__container govuk-width-container">
                <div class="govuk-header__logo">
                  <a href="https://www.gov.uk/" class="govuk-header__link govuk-header__link--homepage">
                    <span class="govuk-header__logotype">
                      <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" height="30" width="36"
                           class="govuk-header__logotype-crown-fallback-image"/>
                      <span class="govuk-header__logotype-text">
                        GOV.UK
                      </span>
                    </span>
                  </a>
                </div>
                <div class="govuk-header__content">
                  <a href="https://pip-frontend.staging.platform.hmcts.net/view-option" class="govuk-header__link govuk-header__link--service-name">
                    Court and tribunal hearings
                  </a>
                </div>
              </div>
            </header>
            
            
            <div class="govuk-width-container ">
            
            
              <nav class="moj-sub-navigation pub-navigation govuk-!-margin-bottom-0" aria-label="Primary navigation">
            
                <ul class="moj-sub-navigation__list">
                  <li class="moj-sub-navigation__item">
                    <a class="moj-sub-navigation__link" href="https://pip-frontend.staging.platform.hmcts.net/view-option">Home</a>
                </ul>
              </nav>
            
              <main class="govuk-main-wrapper " id="main-content" role="main">
            
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" rel="stylesheet">
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.css" rel="stylesheet">
                <div class="row">
                  <div class="col1">
                    <div id="api">
                    </div>
                  </div>
                  <div class="col2">
                  </div>
                </div>
              </main>
            </div>
            
            <footer class="govuk-footer " role="contentinfo">
              <div class="govuk-width-container ">
            
                <div class="govuk-footer__meta">
                  <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
            
                    <h2 class="govuk-visually-hidden">Support links</h2>
            
                    <ul class="govuk-footer__inline-list">
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/help">
          +             <a class="govuk-footer__link" href="https://gov.uk/help">
                          Help
                        </a>
                      </li>
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/privacy-policy">
          -               Privacy policy
          +             <a class="govuk-footer__link" href="https://gov.uk/help/privacy-notice">
          +               Privacy
                        </a>
                      </li>
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cymraeg">
          -               Cymraeg
          -             </a>
          -           </li>
          - 
          -           <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cookie-policy">
          -               Cookie policy
          +               Cookies
                        </a>
                      </li>
          - 
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/accessibility-statement">
                          Accessibility statement
                        </a>
                      </li>
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Contact">
          +             <a class="govuk-footer__link" href="https://gov.uk/contact">
                          Contact
                        </a>
                      </li>
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/terms-and-conditions">
          +             <a class="govuk-footer__link" href="https://www.gov.uk/help/terms-conditions">
                          Terms and conditions
                        </a>
                      </li>
          - 
          +           <li class="govuk-footer__inline-list-item">
          +             <a class="govuk-footer__link" href="https://www.gov.uk/cymraeg">
          +               Welsh
          +             </a>
          +           </li>
          +           <li class="govuk-footer__inline-list-item">
          +             <a class="govuk-footer__link" href="https://www.gov.uk/government/organisations/government-digital-service">
          +               Government Digital Service
          +             </a>
          +           </li>
                    </ul>
            
                    <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.png" height="17" width="41"
                         class="govuk-footer__licence-logo"/>
                    <span class="govuk-footer__licence-description">
                      All content is available under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
                    </span>
                    <p class="govuk-footer__licence-description">When you use this information under the OGL,
                      you should include the following attribution: Contains public sector information licensed under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a>
                    </p>
                    <p class="govuk-footer__licence-description govuk-!-margin-0">The
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a> does not cover use of any personal data in the
                         court and tribunal hearings service. Personal data is subject to applicable data protection laws.
                    </p>
                  </div>
                  <div class="govuk-footer__meta-item">
                    <a class="govuk-footer__link govuk-footer__copyright-logo"
                       href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">©
                      Crown copyright</a>
                  </div>
                </div>
              </div>
            </footer>
            
            </body>
            </html>
        EOT
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.html" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["login.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.html"
      ~ source_content         = <<-EOT # forces replacement
            <html lang="en" class="govuk-template ">
            <head>
              <meta charset="utf-8">
              <title>
                Sign in with a Court and tribunal hearings account
              </title>
              <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
              <meta name="theme-color" content="#0b0c0c">
              <link rel="shortcut icon" sizes="16x16 32x32 48x48" href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico"
                    type="image/x-icon">
              <meta http-equiv="X-UA-Compatible" content="IE=edge">
              <link rel="stylesheet" href="login.css">
            </head>
            <body>
            <script>document.body.className = ((document.body.className) ? document.body.className + ' js-enabled' : 'js-enabled');</script>
            
            
            <a href="#main-content" class="govuk-skip-link">Skip to main content</a>
            
            
            <header class="govuk-header " role="banner" data-module="govuk-header">
              <div class="govuk-header__container govuk-width-container">
                <div class="govuk-header__logo">
                  <a href="https://www.gov.uk/" class="govuk-header__link govuk-header__link--homepage">
                    <span class="govuk-header__logotype">
                      <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" height="30" width="36"
                           class="govuk-header__logotype-crown-fallback-image"/>
                      <span class="govuk-header__logotype-text">
                        GOV.UK
                      </span>
                    </span>
            
                  </a>
                </div>
            
                <div class="govuk-header__content">
            
                  <a href="https://pip-frontend.staging.platform.hmcts.net/view-option" class="govuk-header__link govuk-header__link--service-name">
                    Court and tribunal hearings
                  </a>
            
            
                </div>
            
              </div>
            </header>
            
            
            <div class="govuk-width-container ">
            
            
              <nav class="moj-sub-navigation pub-navigation govuk-!-margin-bottom-0" aria-label="Primary navigation">
            
                <ul class="moj-sub-navigation__list">
                  <li class="moj-sub-navigation__item">
                    <a class="moj-sub-navigation__link" href="https://pip-frontend.staging.platform.hmcts.net/">Home</a>
                </ul>
            
              </nav>
            
            
              <main class="govuk-main-wrapper " id="main-content" role="main">
            
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" rel="stylesheet">
                <div class="row">
                  <div class="col1">
                    <div id="api">
                    </div>
                  </div>
                  <div class="col2">
                  </div>
                </div>
            
            
                </div>
            
              </main>
            </div>
            
            
            <footer class="govuk-footer " role="contentinfo">
              <div class="govuk-width-container ">
            
                <div class="govuk-footer__meta">
                  <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
            
                    <h2 class="govuk-visually-hidden">Support links</h2>
            
                    <ul class="govuk-footer__inline-list">
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/help">
          +             <a class="govuk-footer__link" href="https://gov.uk/help">
                          Help
                        </a>
                      </li>
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/privacy-policy">
          -               Privacy policy
          +             <a class="govuk-footer__link" href="https://gov.uk/help/privacy-notice">
          +               Privacy
                        </a>
                      </li>
          - 
                      <li class="govuk-footer__inline-list-item">
          -             <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cymra

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

"contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-ad-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-ad-url/393424f8773241fe98a1be70736818b9"
        name                    = "b2c-ad-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-admin-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-admin-url/8e6dde85b50a4d16853643cdcf299ff3"
        name                    = "b2c-admin-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-auth-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-auth-endpoint/5a11d3a5a21f4285962e13216c4bb605"
        name                    = "b2c-auth-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-admin-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-admin-endpoint/51386e906269465da6b4663bbc76a227"
        name                    = "b2c-config-admin-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-endpoint/4b8816cc89174ea5a5340362d401419e"
        name                    = "b2c-config-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-extension-app-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-extension-app-id/1f338cfb15a44dde8c9edceaf00405ae"
        name                    = "b2c-extension-app-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-tenant-id/0a88f286fefb4ecdb9134a323b7a55bc"
        name                    = "b2c-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-token-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-token-endpoint/6bdeecbdd6e3403090cc949f5c72d9b4"
        name                    = "b2c-token-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-url/13887feb82b94246a9343877dacb52d6"
        name                    = "b2c-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["cft-idam-client-secret"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/cft-idam-client-secret/76d5fa70c6da4ffba3f4830dada411d7"
        name                    = "cft-idam-client-secret"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["session-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/session-key/87a32fee4d2640c087c224a85291a2fd"
        name                    = "session-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "purpose"             = "b2c-session"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-connection-string/f4c0b02ffdf84eeeb6ea24e78f2f40a4"
        name                    = "shared-storageaccount-connection-string"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-key/2a694c11a4814948bf6f093be1a08933"
        name                    = "shared-storageaccount-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-name/c47855dfbfdf4acbb028628fc6cd6cd5"
        name                    = "shared-storageaccount-name"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
        name                       = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
        name                       = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg|pip-ss-sdp-kv-stg"
        name                       = "pip-ss-sdp-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-cache-stg/providers/Microsoft.Cache/Redis/pip-stg"
        name                          = "pip-stg"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 642 -> 300
          ~ maxmemory_delta                 = 642 -> 200
          ~ maxmemory_reserved              = 642 -> 200
            # (7 unchanged attributes hidden)
        }
    }

Plan: 6 to add, 36 to change, 6 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
        name                       = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }
  # module.sa.azurerm_storage_account.storage_account has been changed
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                              = "pipsssastg"
      + sftp_enabled                      = false
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#vh-devops"
            "application"            = "publishing-information-service"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#publishing-and-information"
            "environment"            = "staging"
            "managedBy"              = "Future Hearings - Publishing Information Project"
        }
        # (48 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # azurerm_key_vault_access_policy.app_mi_access_policy has been changed
  ~ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed"
      + storage_permissions     = []
        # (6 unchanged attributes hidden)
    }
  # azurerm_application_insights.nodejs has been changed
  ~ resource "azurerm_application_insights" "nodejs" {
        id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-nodejs-appinsights"
        name                                  = "pip-ss-stg-nodejs-appinsights"
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (15 unchanged attributes hidden)
    }
  # azuread_application.frontend_apps["frontend"] has been changed
  ~ resource "azuread_application" "frontend_apps" {
        id                             = "230bec9c-3991-4499-abe3-e58276a7dd99"
        tags                           = []
        # (15 unchanged attributes hidden)







      ~ web {
          ~ redirect_uris = [
              - "https://pip-frontend-pr-528.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-528.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-554.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-554.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-565.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-565.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-567.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-567.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-569.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-569.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-574.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-574.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-580.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-580.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-582.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-582.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-583.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-583.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-584.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-584.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-619.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-619.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-620.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-620.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-621.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-621.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-623.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-623.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-645.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-645.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-646.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-646.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-647.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-647.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-648.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-648.dev.platform.hmcts.net/login/return",
                # (26 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
        # (6 unchanged blocks hidden)
    }
  # azurerm_application_insights.java has been changed
  ~ resource "azurerm_application_insights" "java" {
        id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-java-appinsights"
        name                                  = "pip-ss-stg-java-appinsights"
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (15 unchanged attributes hidden)
    }
  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_runbook.client_serects has been changed
  ~ resource "azurerm_automation_runbook" "client_serects" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/runbooks/secret-rotation-b2c-apps"
      ~ job_schedule             = [
          + {
              + job_schedule_id = "e63c1fa5-16a9-4d8e-bdb0-9fd7860f766d"
              + parameters      = {}
              + run_on          = ""
              + schedule_name   = "rotate-client-secrets-schedule"
            },
          - {
              - job_schedule_id = "ea7edaed-6fb3-4680-847e-f8e444042ca7"
              - parameters      = {}
              - run_on          = ""
              - schedule_name   = "rotate-client-secrets-schedule"
            },
        ]
        name                     = "secret-rotation-b2c-apps"
        tags                     = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (9 unchanged attributes hidden)
    }
  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
        name                       = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }
  # module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg|pip-ss-sdp-kv-stg"
        name                       = "pip-ss-sdp-kv-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":78,"Program":"tfcmt","SHA1":"","Vars":{}} -->